app/controllers/tasks_controller.rb

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`created_at`, `description`, `done`, `updated_at`) VALUES ('2012-09-13 02:58:59', 'test', 1, '2012-09-13 02:58:59')